In [1]:
import pandas as pd

Pandas DataFrame consists of three principles, the data, row and column
  * numpy Matrix can store single data type while dataframe can store multiple datatype
  * advance version of numpy is pandas for data analysis
  *series has custome index value, vector does not have
  * dataFrame constracted by multiple series values

In [2]:
df=pd.read_csv("data.csv")
df

    Name   Roll Department  Marks  Semester
0    Sonu    23        cse     34         2
1   Nmonu    24         ee     45         4
2    Golu    25      mache     65         6
3   Bholu    26      civil     98         7
4    Gita    27        cse     78         3
5    Sita    28         ee     56         2
6    Mita    29        ppt     34         5
7  Babita    30       elet     77         6
8  Kabita    31      civil     33         4
9  Sabita    32        cse     73         2

In [3]:
list=['akd','pkg','almm','kalam','mukesh']
df1=pd.DataFrame(list)
df1

        0
0     akd
1     pkg
2    almm
3   kalam
4  mukesh

In [4]:
dictionary={'NAme':['Mukesh','Pankaj','sukesh','arun'],
           'Age':[32,23,24,44],
           'Roll':[1,2,3,4],
           'Adress':['Delhi','Mumbai','Noida','Gurgao'],
           'Qualification':['B.tech','M.tech','phd','bba']}
df2=pd.DataFrame(dictionary)

df2

     NAme  Age  Roll  Adress Qualification
0  Mukesh   32     1   Delhi        B.tech
1  Pankaj   23     2  Mumbai        M.tech
2  sukesh   24     3   Noida           phd
3    arun   44     4  Gurgao           bba

In [5]:
print(df2[['NAme','Age']])

     NAme  Age
0  Mukesh   32
1  Pankaj   23
2  sukesh   24
3    arun   44

In [6]:
df2['Profession']=['Engineer','Teacher','Professor','Engineer']

In [7]:
df2

     NAme  Age  Roll  Adress Qualification Profession
0  Mukesh   32     1   Delhi        B.tech   Engineer
1  Pankaj   23     2  Mumbai        M.tech    Teacher
2  sukesh   24     3   Noida           phd  Professor
3    arun   44     4  Gurgao           bba   Engineer

In [8]:
df2.drop('Age',axis=1)

     NAme  Roll  Adress Qualification Profession
0  Mukesh     1   Delhi        B.tech   Engineer
1  Pankaj     2  Mumbai        M.tech    Teacher
2  sukesh     3   Noida           phd  Professor
3    arun     4  Gurgao           bba   Engineer

In [9]:
df2.drop(1,axis=0)

     NAme  Age  Roll  Adress Qualification Profession
0  Mukesh   32     1   Delhi        B.tech   Engineer
2  sukesh   24     3   Noida           phd  Professor
3    arun   44     4  Gurgao           bba   Engineer

In [10]:
df2

     NAme  Age  Roll  Adress Qualification Profession
0  Mukesh   32     1   Delhi        B.tech   Engineer
1  Pankaj   23     2  Mumbai        M.tech    Teacher
2  sukesh   24     3   Noida           phd  Professor
3    arun   44     4  Gurgao           bba   Engineer

In [11]:
df2.drop(2,axis=0,inplace=True)# change in original DataFrame

In [12]:
df2

     NAme  Age  Roll  Adress Qualification Profession
0  Mukesh   32     1   Delhi        B.tech   Engineer
1  Pankaj   23     2  Mumbai        M.tech    Teacher
3    arun   44     4  Gurgao           bba   Engineer

In [13]:
df2['Age'].max()

44

In [14]:
df2['Age'].min()

23

In [15]:
df2[df2.Age>43]

   NAme  Age  Roll  Adress Qualification Profession
3  arun   44     4  Gurgao           bba   Engineer

In [16]:
df2['NAme'][df2['Age']==df2['Age'].max()]

3    arun
Name: NAme, dtype: object

In [17]:
df2.index

Int64Index([0, 1, 3], dtype='int64')

In [18]:
df2.describe()

             Age      Roll
count   3.000000  3.000000
mean   33.000000  2.333333
std    10.535654  1.527525
min    23.000000  1.000000
25%    27.500000  1.500000
50%    32.000000  2.000000
75%    38.000000  3.000000
max    44.000000  4.000000

In [19]:
ndf=df2.set_index('NAme')
ndf

        Age  Roll  Adress Qualification Profession
NAme
Mukesh   32     1   Delhi        B.tech   Engineer
Pankaj   23     2  Mumbai        M.tech    Teacher
arun     44     4  Gurgao           bba   Engineer

In [20]:
ndf.isnull()

          Age   Roll  Adress  Qualification  Profession
NAme
Mukesh  False  False   False          False       False
Pankaj  False  False   False          False       False
arun    False  False   False          False       False

In [21]:
df2.notnull()

   NAme   Age  Roll  Adress  Qualification  Profession
0  True  True  True    True           True        True
1  True  True  True    True           True        True
3  True  True  True    True           True        True

In [22]:
import pandas as pd 
import numpy as np
dict={'Name':['Pankaj','Parmeshwar','Pradumann',np.nan,'Ajay'],
     'Age':[23,np.nan,np.nan,54,67],
     'marks':[np.nan,45,67,np.nan,43]}

In [23]:
dict1=pd.DataFrame(dict)

In [24]:
dict1

         Name   Age  marks
0      Pankaj  23.0    NaN
1  Parmeshwar   NaN   45.0
2   Pradumann   NaN   67.0
3         NaN  54.0    NaN
4        Ajay  67.0   43.0

In [25]:
dict1.fillna(0)

         Name   Age  marks
0      Pankaj  23.0    0.0
1  Parmeshwar   0.0   45.0
2   Pradumann   0.0   67.0
3           0  54.0    0.0
4        Ajay  67.0   43.0

In [26]:
dict1.dropna()

   Name   Age  marks
4  Ajay  67.0   43.0

In [27]:
data=pd.read_csv("C:\\Users\\parme\\Desktop\\files\\machine learning\\csv data_set\\house_prediction_model2\\data.csv")

In [28]:
data.head()

,date,price,bedrooms,bathrooms,sqft_living,sqft_lot,floors,waterfront,view,condition,sqft_above,sqft_basement,yr_built,yr_renovated,street,city,statezip,country
0,2014-05-02 00:00:00,313000.0,3.0,1.50,1340,7912,1.5,0,0,3,1340,0,1955,2005,18810 Densmore Ave N,Shoreline,WA 98133,USA
1,2014-05-02 00:00:00,2384000.0,5.0,2.50,3650,9050,2.0,0,4,5,3370,280,1921,0,709 W Blaine St,Seattle,WA 98119,USA
2,2014-05-02 00:00:00,342000.0,3.0,2.00,1930,11947,1.0,0,0,4,1930,0,1966,0,26206-26214 143rd Ave SE,Kent,WA 98042,USA
3,2014-05-02 00:00:00,420000.0,3.0,2.25,2000,8030,1.0,0,0,4,1000,1000,1963,0,857 170th Pl NE,Bellevue,WA 98008,USA
4,2014-05-02 00:00:00,550000.0,4.0,2.50,1940,10500,1.0,0,0,4,1140,800,1976,1992,9105 170th Ave NE,Redmond,WA 98052,USA

# Making a seariex
* by list 
* by array
* by dictionary
* by

In [29]:
level=[23,4,5,7]
arr=np.array([23,4,57,8])
dict={'a':56,'b':23,'c':20,'d':54}

In [30]:
dict

{'a': 56, 'b': 23, 'c': 20, 'd': 54}

In [31]:
pd.Series(dict)

a    56
b    23
c    20
d    54
dtype: int64

In [32]:
pd.Series(arr,  index=level)

23    23
4      4
5     57
7      8
dtype: int32

In [33]:
pd.Series(dict, index=arr)

23   NaN
4    NaN
57   NaN
8    NaN
dtype: float64

In [34]:
sport=pd.Series([23,45,67],index=['anupam','abhishek','pankaj'])

In [35]:
sport

anupam      23
abhishek    45
pankaj      67
dtype: int64

In [36]:
sport['anupam']

23

In [37]:
data1=pd.read_csv("data1.csv")

In [38]:
data1

        City      Item  price
0      delhi      boot    100
1      delhi    caepet    122
2      delhi     chail    124
3   gurugram    flower    225
4   gurugram     frute    233
5   gurugram     vada     234
6     mumbai     chees    234
7     mumbai      snow    234
8     mumbai  panipuri    300
9     mumbai   parathe    445
10     noida    jalebi    456
11     noida     laddu    456
12     noida       pen    532
13     noida     petha   1000

In [39]:
ndf=data1.groupby("City")
ndf

In [40]:
for City,data in ndf:
    print(City)

delhi
gurugram
mumbai
noida

In [41]:
ndf.get_group('delhi')

    City    Item  price
0  delhi    boot    100
1  delhi  caepet    122
2  delhi   chail    124

In [42]:
ndf.get_group('noida')

     City    Item  price
10  noida  jalebi    456
11  noida   laddu    456
12  noida     pen    532
13  noida   petha   1000

In [43]:
ndf.mean()

               price
City
delhi     115.333333
gurugram  230.666667
mumbai    303.250000
noida     611.000000

In [44]:
ndf.describe()

         price
         count        mean         std    min    25%    50%     75%     max
City
delhi      3.0  115.333333   13.316656  100.0  111.0  122.0  123.00   124.0
gurugram   3.0  230.666667    4.932883  225.0  229.0  233.0  233.50   234.0
mumbai     4.0  303.250000   99.489949  234.0  234.0  267.0  336.25   445.0
noida      4.0  611.000000  261.796359  456.0  456.0  494.0  649.00  1000.0

In [45]:
ndf.size()

City
delhi       3
gurugram    3
mumbai      4
noida       4
dtype: int64

In [46]:
for df1 in ndf:
    print(df1)

('delhi',     City    Item  price
0  delhi    boot    100
1  delhi  caepet    122
2  delhi   chail    124)
('gurugram',        City    Item  price
3  gurugram  flower    225
4  gurugram   frute    233
5  gurugram   vada     234)
('mumbai',      City      Item  price
6  mumbai     chees    234
7  mumbai      snow    234
8  mumbai  panipuri    300
9  mumbai   parathe    445)
('noida',      City    Item  price
10  noida  jalebi    456
11  noida   laddu    456
12  noida     pen    532
13  noida   petha   1000)

In [47]:
for City,df1 in ndf:
    print(City)
    print(df1)

delhi
    City    Item  price
0  delhi    boot    100
1  delhi  caepet    122
2  delhi   chail    124
gurugram
       City    Item  price
3  gurugram  flower    225
4  gurugram   frute    233
5  gurugram   vada     234
mumbai
     City      Item  price
6  mumbai     chees    234
7  mumbai      snow    234
8  mumbai  panipuri    300
9  mumbai   parathe    445
noida
     City    Item  price
10  noida  jalebi    456
11  noida   laddu    456
12  noida     pen    532
13  noida   petha   1000

In [48]:
ndf.min()

            Item  price
City
delhi       boot    100
gurugram  flower    225
mumbai     chees    234
noida     jalebi    456

In [49]:
ndf.max()

           Item  price
City
delhi     chail    124
gurugram  vada     234
mumbai     snow    445
noida     petha   1000

In [50]:
ndf.mean()

               price
City
delhi     115.333333
gurugram  230.666667
mumbai    303.250000
noida     611.000000

In [51]:
ndf.describe()

         price
         count        mean         std    min    25%    50%     75%     max
City
delhi      3.0  115.333333   13.316656  100.0  111.0  122.0  123.00   124.0
gurugram   3.0  230.666667    4.932883  225.0  229.0  233.0  233.50   234.0
mumbai     4.0  303.250000   99.489949  234.0  234.0  267.0  336.25   445.0
noida      4.0  611.000000  261.796359  456.0  456.0  494.0  649.00  1000.0

In [52]:
# k=ndf['City']=='delhi'
# ndf.loc[k]

df=pd.DataFrame(

In [53]:
df=pd.DataFrame({'name':['arun','pankaj','neha','pooja'],
                'age':[32,45,67,87],
                'weight':[67,24,34,65]})

In [54]:
df

     name  age  weight
0    arun   32      67
1  pankaj   45      24
2    neha   67      34
3   pooja   87      65

In [55]:
df1=pd.DataFrame({'name':['arun','pankaj','neha','pooja'],
                'marks':[32,45,67,87]})

In [56]:
 df1

     name  marks
0    arun     32
1  pankaj     45
2    neha     67
3   pooja     87

In [57]:
ndf1=pd.concat([df,df1])

In [58]:
ndf1

     name   age  weight  marks
0    arun  32.0    67.0    NaN
1  pankaj  45.0    24.0    NaN
2    neha  67.0    34.0    NaN
3   pooja  87.0    65.0    NaN
0    arun   NaN     NaN   32.0
1  pankaj   NaN     NaN   45.0
2    neha   NaN     NaN   67.0
3   pooja   NaN     NaN   87.0

In [59]:
ndf=pd.concat([df,df1], ignore_index=True)

In [60]:
ndf

     name   age  weight  marks
0    arun  32.0    67.0    NaN
1  pankaj  45.0    24.0    NaN
2    neha  67.0    34.0    NaN
3   pooja  87.0    65.0    NaN
4    arun   NaN     NaN   32.0
5  pankaj   NaN     NaN   45.0
6    neha   NaN     NaN   67.0
7   pooja   NaN     NaN   87.0